{
  "devblogs": {
    "0": {
      "link": "https://warthunder.com/en/news/8276-development-su-25t-and-the-pre-order-of-the-su-39-sergey-strikes-back-en",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/Aircraft/_thumbs/520x/anons_378_su_25tm_8baf67ef133ddd03a9c191aadfd6daeb.jpg",
      "title": "Su-25T and the pre-order of the Su-39: Sergey Strikes Back!",
      "description": "Both researchable and Premium versions of the advanced Su-25 attack aircraft are to be added in the upcoming La Royale major update. Pre-order now to get special bonuses!"
    },
    "1": {
      "link": "https://warthunder.com/en/news/8295-development-battleship-lorraine-the-last-french-dreadnought-en",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/Navy/_thumbs/520x/anons_battleship_bretagne_class_lorraine_1e7b7811d7ceec41fa689848d7501264.jpg",
      "title": "Battleship Lorraine: the last French dreadnought",
      "description": "Meet the Bretagne-class Lorraine battleship, the pinnacle of the French bluewater tech tree in the upcoming La Royale update!"
    },
    "2": {
      "link": "https://warthunder.com/en/news/8291-development-missile-science-new-physics-with-line-of-sight-guidance-missiles-en",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/_thumbs/520x/ATGM_10_Anons_0dc5f81f1fdd865c12909976cbb2864e.jpg",
      "title": "Missile Science: new physics with line-of-sight guidance missiles",
      "description": "We present details on the revised physics of guided missiles with line-of-sight guidance in the La Royale update."
    }
  },
  "events": {
    "0": {
      "link": "https://warthunder.com/en/news/8281-event-pages-of-history-june-en",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/_thumbs/520x/catalina_378x213_f9ac9ad5712307483776980f4d983c7f.jpg",
      "title": "Pages of History (June)",
      "description": "In this month's Pages of History you'll find yourself in the center of events that happened at numerous battlefronts. Two of the more important Pacific battles, the landings in Normandy, and the beginning of Operation Barbarossa — participate in battles using the vehicles that were used in these historic events and receive prizes!"
    },
    "1": {
      "link": "https://warthunder.com/en/news/8226-event-victory-day-in-war-thunder-en",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/Other/_thumbs/520x/anons_378_victory_day_2023_a9589f0f213ad1296393b08763a2b983.jpg",
      "title": "Victory Day in War Thunder",
      "description": "Victory! Many allied countries spent years with trials and tribulations to end the bloodiest war in the history of humanity, and in early May of 1945 their efforts finally bore fruit. This victory is the most important event of the XXth century that is remembered and celebrated today by tens of millions of people. Join us in War Thunder to commemorate this event!"
    },
    "2": {
      "link": "https://warthunder.com/en/news/8227-event-legend-of-victory-bm-31-12-andryusha-en",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/Ground/_thumbs/520x/378_06_bm_31_12_5_1ed0960f3a8fc75b6d89213035e56ca3.jpg",
      "title": "Legend of Victory: BM-31-12 “Andryusha”",
      "description": "Meet the bane of the Wehrmacht — MLRS BM-31-12 “Andryusha”! This vehicle undertook its baptism by fire under Novgorod in Russia and helped push the front way back to Berlin — truly a Legend of Victory! You can receive it and many other prizes, including keys from the “Demolition crate” that contains items from past War Thunder events!"
    }
  },
  "changelogs": {
    "0": {
      "link": "https://warthunder.com/en/game/changelog/current/1466",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/anons_378_sky_guardians_ah_6m_logo_eng_e4c0326b7cb01545e425e9bfe6b3ceca.jpg",
      "title": "War Thunder \"Sky Guardians\" - Changelog",
      "description": "The first units for the French naval tree, new and updated graphical effects and data structure optimization  along with ejection seats for selected modern jets. Amongst the 43 new as well as updated vehicle models, one can't help but mention the real behemoth - the Char2, the agile AH-6M \"Little Bird\" helicopter or the first French light cruiser; Duguay-Trouin!. In addition to all this, the winter version of the location \"Seversk\", a new location for fans of avionics - Pyrenees, and as always, many improvements and fixes! Let's welcome the \"Sky Guardians\" update!"
    },
    "1": {
      "link": "https://warthunder.com/en/game/changelog/current/1501",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/Navy/hood_378_a75d6ef3b827ce55804cfde9a562055a.jpg",
      "title": "Update 2.25.1.131",
      "description": "Automatic firing of the AI-controlled main calibre turrets on blue water ships has been disabled. When switching to the second and third cannon group the main cannons remain aimed wherever the player was aiming when changing."
    },
    "2": {
      "link": "https://warthunder.com/en/game/changelog/current/1499",
      "banner": "https://static.warthunder.com/upload/image//0_2022_Anons/Aircraft/aircraft7_TW_Anons_bc110be06a9968653fa6d7571c170b43.png",
      "title": "Update 2.25.1.125",
      "description": "In the “Main Parameters” menu in the “Privacy and Confidentiality” tab, a new setting “Hide player nicknames” has been added. This setting allows to hide nicknames of players in battle or change nicknames to numeric UserID values. This option is helpful for streamers who may meet players in battle with nicknames from other platforms (Steam, PSN, Xbox etc.), which in accordance to their rules may contain inappropriate symbols or words, and therefore may in rare cases, cause blocking on streaming services."
    }
  }
}