{
  "devblogs": {
    "0": {
      "link": "https://warthunder.com/en/news/8418-development-to-55-the-scorched-land-en",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Ground/_thumbs/520x/anons_to_55_dc3ec0d9b45652f0402647f280f02b8f.jpg",
      "title": "TO-55: the Scorched Land",
      "description": "The TO-55 is a Soviet flamethrower tank based on the T-55 medium tank coming to the game in the next major update!"
    },
    "1": {
      "link": "https://warthunder.com/en/news/8414-development-roadmap-following-the-roadmap-grouping-vehicles-rank-changes-and-improvements-to-premium-vehicles-en",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Other/_thumbs/520x/wt_1_81_steam_378_27960be2163468b8f088eb92dc0e8dac.jpg",
      "title": "Following the Roadmap: grouping vehicles, rank changes, and improvements to premium vehicles",
      "description": "We’re continuing to move along with our Roadmap that we released back in June. First and foremost, we’d like to start off by saying thank you for your patience and understanding whilst we progress through it. Recently, after releasing other roadmap changes, we’ve noticed your anticipation and enthusiasm about progression changes and today we’re pleased to announce that we’re ready to talk about these changes with you."
    },
    "2": {
      "link": "https://warthunder.com/en/news/8416-development-pvkv-iv-the-last-effort-en",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Ground/_thumbs/520x/anons_pvkv_iv_52e903c97a9de53a0d200a0ba9847dde.jpg",
      "title": "Pvkv IV: the Last Effort",
      "description": "The Pvkv IV is the final design of a series of experimental Swedish tank destroyers, developed in the postwar period in an effort to equip the armed forces with modern fighting vehicles. Soon, the Pvkv IV will reinforce the early ranks of the Swedish ground forces tree with its arrival as part of the next major War Thunder update!"
    }
  },
  "events": {
    "0": {
      "link": "https://warthunder.com/en/news/8384-event-summer-extreme-en",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/_thumbs/520x/anons_378_summer_marathon_2023_e7b51ee0e23e1d95dc8328dd17c9ea9d.jpg",
      "title": "Summer Extreme",
      "description": "Hot summer is the perfect time for extreme sports! Ride the wind using a wingsuit or a paraglider, conquer the waves on a board or a jet ski, explore the off-road wilderness on a bike or perform tricks on a skateboard — whichever you prefer, you’ll be able to show off your hobby in War Thunder thanks to new sets of thematic decals and decorations that you’ll be able to receive in the Summer Extreme event!"
    },
    "1": {
      "link": "https://warthunder.com/en/news/8366-event-pages-of-history-august-en",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Ground/_thumbs/520x/art_t72av_turms_378x213_9825989432d5d041532d2b4160a5dce1.jpg",
      "title": "Pages of History (August)",
      "description": "In this month's Pages of History you'll find yourself at the centre of events that happened at numerous battlefronts. Battle for Britain, Falaise Pocket, Invasion of Kuwait and Operation Barbarossa — participate in battles using the vehicles that were used in these historic events and receive prizes!"
    },
    "2": {
      "link": "https://warthunder.com/en/news/8352-event-combat-robots-of-atomic-heart-come-to-war-thunder-en",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Other/_thumbs/520x/anons_378_atomic_thunder_efb0b05cb83a1d7090e2c83d112ed05a.jpg",
      "title": "Combat Robots of Atomic Heart come to War Thunder!",
      "description": "As you know, combat robots from the Atomic Heart world are being tested on the battlefields of War Thunder. From July 11th to July 31st, unique robots created at Enterprise 3826 will meet in battle with armored vehicles and helicopters of the Cold War era from the USSR and USA in Test Facility 2271."
    }
  },
  "changelogs": {
    "0": {
      "link": "https://warthunder.com/en/game/changelog/current/1503",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/anons_378_la_royale_logo_990e0dda852f8f551dadc8538cd93305.jpg",
      "title": "War Thunder \"La Royale\" - Changelog",
      "description": "The beginning of the Closed Beta Test for the French Naval forces, new and updated graphical effects for flares, afterburners, rockets and missiles along with new hit marks on ground vehicles. More than 50 new or updated vehicles. Amongst them 14 new ships for the French Navy! But sailors are not the only ones to find something for themselves here! The Mighty F-14B, three different Sukhoi jets, the unusual M1 KVT tank or the first tank from India in WT - Vijayanta! Two new locations, fortifications mechanics, new weapons for aircraft and much more awaits you in La Royale update!"
    },
    "1": {
      "link": "https://warthunder.com/en/game/changelog/current/1533",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Navy/ship3_TW_Anons_ce708b3d4513c2ca41fefb772c4da9d3.png",
      "title": "Server Update 25.08.2023",
      "description": "A bug that caused server crashes has been fixed."
    },
    "2": {
      "link": "https://warthunder.com/en/game/changelog/current/1532",
      "banner": "https://warthunder.com/upload/image//0_2022_Anons/Ground/Abrams_Anons_0c5f12dafaaa17e94e139e3c480ba019.jpg",
      "title": "Server Update 23.08.2023",
      "description": "The hit camera for recently respawned enemies that are in a state of temporary invulnerability has been returned."
    }
  }
}