{
  "devblogs": {
    "0": {
      "link": "https://warthunder.com/en/news/8537-development-m109-the-king-of-battle-en",
      "banner": "https://staticfiles.warthunder.com/upload/image/0_2022_Anons/Ground/_thumbs/519x293/anons_378_m109_5c0349bae1952a93e358715f8ecb2207_519x293_3b82c231dd2bfd90355e4373563d05a2.jpg",
      "title": "M109: The King of Battle",
      "description": "The M109 is an American Cold War era SPH, developed during the early 1950s as a replacement for outdated postwar designs. The anticipated M109 will arrive to War Thunder as part of the upcoming “Kings of Battle” major update!"
    },
    "1": {
      "link": "https://warthunder.com/en/news/8531-development-ah-129d-mangusta-spiked-up-mongoose-en",
      "banner": "https://staticfiles.warthunder.com/upload/image/0_2022_Anons/Helicopter/_thumbs/519x293/anons_378_a_129_b_e937ee2b1984c5ad364a020c9464825a_519x293_ed6d8cb861913c55fdf73e7ed692e496.jpg",
      "title": "AH-129D Mangusta: Spiked Up Mongoose",
      "description": "The AH-129D is the penultimate variant of the Italian Mangusta attack helicopter, originally introduced during the 1990s. Featuring enhanced firepower, the AH-129D will soon join the top rank of the Italian helicopter tree in the next major update “Kings of Battle”!"
    },
    "2": {
      "link": "https://warthunder.com/en/news/8533-development-battle-pass-vehicles-strikemaster-mk88-en",
      "banner": "https://staticfiles.warthunder.com/upload/image/0_2022_Anons/Aircraft/_thumbs/519x293/anons_378_strikemaster_mk88_186d2c8ed838e4f9227f6ff73bc27ede_519x293_0d9127f3ba10ed8383479a943b463959.jpg",
      "title": "Battle pass vehicles: Strikemaster Mk.88",
      "description": "Welcome to the main aviation prize of the upcoming season of the War Thunder Battle pass called “Tropical Storm”, the Strikemaster Mk.88 strike jet aircraft!"
    }
  },
  "events": {
    "0": {
      "link": "https://warthunder.com/en/news/8511-event-battle-of-the-caucasus-a-decal-and-decoration-for-the-80th-anniversary-en",
      "banner": "https://staticfiles.warthunder.com/upload/image/0_2022_Anons/Other/_thumbs/519x293/anons_378_end_battle_caucasus_3e7df06c3d01ae6c3b7cb45c77759455_519x293_a698b5e42661bdb0c6b2dd13ea6fd604.jpg",
      "title": "Battle of the Caucasus: A Decal and Decoration for the 80th Anniversary!",
      "description": "From the summer of 1942, determined Axis forces launched an offensive into the Caucasus region in a bid to capture key locations. In 2 months, they managed to advance to Mozdok, but then hit a barrier — they were stopped from advancing further by the Soviets. From the beginning of 1943, Soviet troops squeezed out Axis forces from many occupied locations. Then, by October 9th 1943, all Axis troops were evacuated from the region, therefore full control of these locations were returned to the Soviets."
    },
    "1": {
      "link": "https://warthunder.com/en/news/8494-event-tokushu-heiki-assemble-and-test-an-honorable-missile-to-obtain-prizes-en",
      "banner": "https://staticfiles.warthunder.com/upload/image/0_2022_Anons/Other/_thumbs/519x293/Small_6601afe866a1db99e39a83b0fe87b3ee_519x293_e27f609831f46a036e8f8a8de92028bb.jpg",
      "title": "Tokushu Heiki: Assemble and test an honorable missile to obtain prizes!",
      "description": "The wait is over — the crafting event has returned, and this time we’ve got some very interesting vehicles coming which have already had dev blogs! To sum it up, build the Ki-148 missile (called the Tokushu Heiki in this event) from WWII, test its flight performance in a special flight test mission, then prepare and create a report which can be exchanged for exclusive prizes during this event!"
    },
    "2": {
      "link": "https://warthunder.com/en/news/8495-event-pages-of-history-october-en",
      "banner": "https://staticfiles.warthunder.com/upload/image/0_2022_Anons/Ground/_thumbs/519x293/centurion_mk10_378x213_109a0e8d1b78dcb73450848fdc1388d9_519x293_2bde846dc020f0b63058f8ae633623dd.jpg",
      "title": "Pages of History (October)",
      "description": "In this month's Pages of History, you'll find yourself at the centre of events that happened at numerous battlefronts. From Hungary and the Netherlands, to Israel and the Solomon Islands — participate in battles using the vehicles that were used in these historic events and receive prizes!"
    }
  },
  "changelogs": {
    "0": {
      "link": "https://warthunder.com/en/game/changelog/current/1536",
      "banner": "",
      "title": "War Thunder \"Sons of Attila\" - Changelog",
      "description": "A vast amount of vehicles, fixes and anticipated Roadmap additions have now been implemented! Flagship jets: F-16C Block 50, Barak II and MiG-29SMT, plus jets for other nations. Italy has gained the Hungarian branch, which includes 11 ground vehicles starting from the Csaba and ending at the KF41, as well as 3 helicopters. The first South Korean vehicle, the VIDAR — which arrives as an export variant used by Norway — also comes to the Swedish tree! The visual effects of wind, smoke and ammo detonations plus more have also been improved, as well as a rank VI Bluewater and 3 premium Battleships have arrived. Two new maps, including the return of “Test Site — 2271”, are also here."
    },
    "1": {
      "link": "https://warthunder.com/en/game/changelog/current/1550",
      "banner": "",
      "title": "Server Update 18.10.2023",
      "description": "The planned Battle Rating changes and other balancing changes in this spreadsheet have been implemented."
    },
    "2": {
      "link": "https://warthunder.com/en/game/changelog/current/1549",
      "banner": "",
      "title": "Update 2.29.0.101",
      "description": "A bug that caused some marketplace camos to not be visible to other players in battle has been fixed."
    }
  }
}